{"keras_version": "2.2.4", "config": {"layers": [{"inbound_nodes": [], "name": "input_1", "config": {"dtype": "float32", "batch_input_shape": [null, null, null, 3], "sparse": false, "name": "input_1"}, "class_name": "InputLayer"}, {"inbound_nodes": [[["input_1", 0, 0, {}]]], "name": "block1_conv1", "config": {"filters": 64, "padding": "same", "strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "name": "block1_conv1", "kernel_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "activation": "relu", "trainable": true, "kernel_size": [3, 3], "dilation_rate": [1, 1], "use_bias": true, "data_format": "channels_last", "bias_constraint": null}, "class_name": "Conv2D"}, {"inbound_nodes": [[["block1_conv1", 0, 0, {}]]], "name": "block1_conv2", "config": {"filters": 64, "padding": "same", "strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "name": "block1_conv2", "kernel_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "activation": "relu", "trainable": true, "kernel_size": [3, 3], "dilation_rate": [1, 1], "use_bias": true, "data_format": "channels_last", "bias_constraint": null}, "class_name": "Conv2D"}, {"inbound_nodes": [[["block1_conv2", 0, 0, {}]]], "name": "block1_pool", "config": {"padding": "valid", "strides": [2, 2], "pool_size": [2, 2], "trainable": true, "name": "block1_pool", "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"inbound_nodes": [[["block1_pool", 0, 0, {}]]], "name": "block2_conv1", "config": {"filters": 128, "padding": "same", "strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "name": "block2_conv1", "kernel_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "activation": "relu", "trainable": true, "kernel_size": [3, 3], "dilation_rate": [1, 1], "use_bias": true, "data_format": "channels_last", "bias_constraint": null}, "class_name": "Conv2D"}, {"inbound_nodes": [[["block2_conv1", 0, 0, {}]]], "name": "block2_conv2", "config": {"filters": 128, "padding": "same", "strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "name": "block2_conv2", "kernel_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "activation": "relu", "trainable": true, "kernel_size": [3, 3], "dilation_rate": [1, 1], "use_bias": true, "data_format": "channels_last", "bias_constraint": null}, "class_name": "Conv2D"}, {"inbound_nodes": [[["block2_conv2", 0, 0, {}]]], "name": "block2_pool", "config": {"padding": "valid", "strides": [2, 2], "pool_size": [2, 2], "trainable": true, "name": "block2_pool", "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"inbound_nodes": [[["block2_pool", 0, 0, {}]]], "name": "block3_conv1", "config": {"filters": 256, "padding": "same", "strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "name": "block3_conv1", "kernel_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "activation": "relu", "trainable": true, "kernel_size": [3, 3], "dilation_rate": [1, 1], "use_bias": true, "data_format": "channels_last", "bias_constraint": null}, "class_name": "Conv2D"}, {"inbound_nodes": [[["block3_conv1", 0, 0, {}]]], "name": "block3_conv2", "config": {"filters": 256, "padding": "same", "strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "name": "block3_conv2", "kernel_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "activation": "relu", "trainable": true, "kernel_size": [3, 3], "dilation_rate": [1, 1], "use_bias": true, "data_format": "channels_last", "bias_constraint": null}, "class_name": "Conv2D"}, {"inbound_nodes": [[["block3_conv2", 0, 0, {}]]], "name": "block3_conv3", "config": {"filters": 256, "padding": "same", "strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "name": "block3_conv3", "kernel_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "activation": "relu", "trainable": true, "kernel_size": [3, 3], "dilation_rate": [1, 1], "use_bias": true, "data_format": "channels_last", "bias_constraint": null}, "class_name": "Conv2D"}, {"inbound_nodes": [[["block3_conv3", 0, 0, {}]]], "name": "block3_pool", "config": {"padding": "valid", "strides": [2, 2], "pool_size": [2, 2], "trainable": true, "name": "block3_pool", "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"inbound_nodes": [[["block3_pool", 0, 0, {}]]], "name": "block4_conv1", "config": {"filters": 512, "padding": "same", "strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "name": "block4_conv1", "kernel_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "activation": "relu", "trainable": true, "kernel_size": [3, 3], "dilation_rate": [1, 1], "use_bias": true, "data_format": "channels_last", "bias_constraint": null}, "class_name": "Conv2D"}, {"inbound_nodes": [[["block4_conv1", 0, 0, {}]]], "name": "block4_conv2", "config": {"filters": 512, "padding": "same", "strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "name": "block4_conv2", "kernel_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "activation": "relu", "trainable": true, "kernel_size": [3, 3], "dilation_rate": [1, 1], "use_bias": true, "data_format": "channels_last", "bias_constraint": null}, "class_name": "Conv2D"}, {"inbound_nodes": [[["block4_conv2", 0, 0, {}]]], "name": "block4_conv3", "config": {"filters": 512, "padding": "same", "strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "name": "block4_conv3", "kernel_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "activation": "relu", "trainable": true, "kernel_size": [3, 3], "dilation_rate": [1, 1], "use_bias": true, "data_format": "channels_last", "bias_constraint": null}, "class_name": "Conv2D"}, {"inbound_nodes": [[["block4_conv3", 0, 0, {}]]], "name": "block4_pool", "config": {"padding": "valid", "strides": [2, 2], "pool_size": [2, 2], "trainable": true, "name": "block4_pool", "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"inbound_nodes": [[["block4_pool", 0, 0, {}]]], "name": "block5_conv1", "config": {"filters": 512, "padding": "same", "strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "name": "block5_conv1", "kernel_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "activation": "relu", "trainable": true, "kernel_size": [3, 3], "dilation_rate": [1, 1], "use_bias": true, "data_format": "channels_last", "bias_constraint": null}, "class_name": "Conv2D"}, {"inbound_nodes": [[["block5_conv1", 0, 0, {}]]], "name": "block5_conv2", "config": {"filters": 512, "padding": "same", "strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "name": "block5_conv2", "kernel_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "activation": "relu", "trainable": true, "kernel_size": [3, 3], "dilation_rate": [1, 1], "use_bias": true, "data_format": "channels_last", "bias_constraint": null}, "class_name": "Conv2D"}, {"inbound_nodes": [[["block5_conv2", 0, 0, {}]]], "name": "block5_conv3", "config": {"filters": 512, "padding": "same", "strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "name": "block5_conv3", "kernel_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "activation": "relu", "trainable": true, "kernel_size": [3, 3], "dilation_rate": [1, 1], "use_bias": true, "data_format": "channels_last", "bias_constraint": null}, "class_name": "Conv2D"}, {"inbound_nodes": [[["block5_conv3", 0, 0, {}]]], "name": "block5_pool", "config": {"padding": "valid", "strides": [2, 2], "pool_size": [2, 2], "trainable": true, "name": "block5_pool", "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"inbound_nodes": [[["block5_pool", 0, 0, {}]]], "name": "global_average_pooling2d_1", "config": {"trainable": true, "name": "global_average_pooling2d_1", "data_format": "channels_last"}, "class_name": "GlobalAveragePooling2D"}, {"inbound_nodes": [[["global_average_pooling2d_1", 0, 0, {}]]], "name": "dense_1", "config": {"activation": "softmax", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "name": "dense_1", "bias_constraint": null, "use_bias": true, "bias_regularizer": null, "units": 2, "trainable": true, "activity_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null}, "class_name": "Dense"}], "name": "model_1", "input_layers": [["input_1", 0, 0]], "output_layers": [["dense_1", 0, 0]]}, "class_name": "Model", "backend": "tensorflow"}