{"backend": "tensorflow", "config": {"input_layers": [["input_1", 0, 0]], "layers": [{"name": "input_1", "class_name": "InputLayer", "inbound_nodes": [], "config": {"batch_input_shape": [null, null, null, 3], "dtype": "float32", "sparse": false, "name": "input_1"}}, {"name": "block1_conv1", "class_name": "Conv2D", "inbound_nodes": [[["input_1", 0, 0, {}]]], "config": {"strides": [1, 1], "name": "block1_conv1", "activation": "relu", "data_format": "channels_last", "padding": "same", "kernel_constraint": null, "trainable": true, "activity_regularizer": null, "bias_constraint": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_size": [3, 3], "use_bias": true, "bias_regularizer": null, "kernel_regularizer": null, "dilation_rate": [1, 1]}}, {"name": "block1_conv2", "class_name": "Conv2D", "inbound_nodes": [[["block1_conv1", 0, 0, {}]]], "config": {"strides": [1, 1], "name": "block1_conv2", "activation": "relu", "data_format": "channels_last", "padding": "same", "kernel_constraint": null, "trainable": true, "activity_regularizer": null, "bias_constraint": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_size": [3, 3], "use_bias": true, "bias_regularizer": null, "kernel_regularizer": null, "dilation_rate": [1, 1]}}, {"name": "block1_pool", "class_name": "MaxPooling2D", "inbound_nodes": [[["block1_conv2", 0, 0, {}]]], "config": {"strides": [2, 2], "name": "block1_pool", "padding": "valid", "data_format": "channels_last", "trainable": true, "pool_size": [2, 2]}}, {"name": "block2_conv1", "class_name": "Conv2D", "inbound_nodes": [[["block1_pool", 0, 0, {}]]], "config": {"strides": [1, 1], "name": "block2_conv1", "activation": "relu", "data_format": "channels_last", "padding": "same", "kernel_constraint": null, "trainable": true, "activity_regularizer": null, "bias_constraint": null, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_size": [3, 3], "use_bias": true, "bias_regularizer": null, "kernel_regularizer": null, "dilation_rate": [1, 1]}}, {"name": "block2_conv2", "class_name": "Conv2D", "inbound_nodes": [[["block2_conv1", 0, 0, {}]]], "config": {"strides": [1, 1], "name": "block2_conv2", "activation": "relu", "data_format": "channels_last", "padding": "same", "kernel_constraint": null, "trainable": true, "activity_regularizer": null, "bias_constraint": null, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_size": [3, 3], "use_bias": true, "bias_regularizer": null, "kernel_regularizer": null, "dilation_rate": [1, 1]}}, {"name": "block2_pool", "class_name": "MaxPooling2D", "inbound_nodes": [[["block2_conv2", 0, 0, {}]]], "config": {"strides": [2, 2], "name": "block2_pool", "padding": "valid", "data_format": "channels_last", "trainable": true, "pool_size": [2, 2]}}, {"name": "block3_conv1", "class_name": "Conv2D", "inbound_nodes": [[["block2_pool", 0, 0, {}]]], "config": {"strides": [1, 1], "name": "block3_conv1", "activation": "relu", "data_format": "channels_last", "padding": "same", "kernel_constraint": null, "trainable": true, "activity_regularizer": null, "bias_constraint": null, "filters": 256, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_size": [3, 3], "use_bias": true, "bias_regularizer": null, "kernel_regularizer": null, "dilation_rate": [1, 1]}}, {"name": "block3_conv2", "class_name": "Conv2D", "inbound_nodes": [[["block3_conv1", 0, 0, {}]]], "config": {"strides": [1, 1], "name": "block3_conv2", "activation": "relu", "data_format": "channels_last", "padding": "same", "kernel_constraint": null, "trainable": true, "activity_regularizer": null, "bias_constraint": null, "filters": 256, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_size": [3, 3], "use_bias": true, "bias_regularizer": null, "kernel_regularizer": null, "dilation_rate": [1, 1]}}, {"name": "block3_conv3", "class_name": "Conv2D", "inbound_nodes": [[["block3_conv2", 0, 0, {}]]], "config": {"strides": [1, 1], "name": "block3_conv3", "activation": "relu", "data_format": "channels_last", "padding": "same", "kernel_constraint": null, "trainable": true, "activity_regularizer": null, "bias_constraint": null, "filters": 256, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_size": [3, 3], "use_bias": true, "bias_regularizer": null, "kernel_regularizer": null, "dilation_rate": [1, 1]}}, {"name": "block3_pool", "class_name": "MaxPooling2D", "inbound_nodes": [[["block3_conv3", 0, 0, {}]]], "config": {"strides": [2, 2], "name": "block3_pool", "padding": "valid", "data_format": "channels_last", "trainable": true, "pool_size": [2, 2]}}, {"name": "block4_conv1", "class_name": "Conv2D", "inbound_nodes": [[["block3_pool", 0, 0, {}]]], "config": {"strides": [1, 1], "name": "block4_conv1", "activation": "relu", "data_format": "channels_last", "padding": "same", "kernel_constraint": null, "trainable": true, "activity_regularizer": null, "bias_constraint": null, "filters": 512, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_size": [3, 3], "use_bias": true, "bias_regularizer": null, "kernel_regularizer": null, "dilation_rate": [1, 1]}}, {"name": "block4_conv2", "class_name": "Conv2D", "inbound_nodes": [[["block4_conv1", 0, 0, {}]]], "config": {"strides": [1, 1], "name": "block4_conv2", "activation": "relu", "data_format": "channels_last", "padding": "same", "kernel_constraint": null, "trainable": true, "activity_regularizer": null, "bias_constraint": null, "filters": 512, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_size": [3, 3], "use_bias": true, "bias_regularizer": null, "kernel_regularizer": null, "dilation_rate": [1, 1]}}, {"name": "block4_conv3", "class_name": "Conv2D", "inbound_nodes": [[["block4_conv2", 0, 0, {}]]], "config": {"strides": [1, 1], "name": "block4_conv3", "activation": "relu", "data_format": "channels_last", "padding": "same", "kernel_constraint": null, "trainable": true, "activity_regularizer": null, "bias_constraint": null, "filters": 512, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_size": [3, 3], "use_bias": true, "bias_regularizer": null, "kernel_regularizer": null, "dilation_rate": [1, 1]}}, {"name": "block4_pool", "class_name": "MaxPooling2D", "inbound_nodes": [[["block4_conv3", 0, 0, {}]]], "config": {"strides": [2, 2], "name": "block4_pool", "padding": "valid", "data_format": "channels_last", "trainable": true, "pool_size": [2, 2]}}, {"name": "block5_conv1", "class_name": "Conv2D", "inbound_nodes": [[["block4_pool", 0, 0, {}]]], "config": {"strides": [1, 1], "name": "block5_conv1", "activation": "relu", "data_format": "channels_last", "padding": "same", "kernel_constraint": null, "trainable": true, "activity_regularizer": null, "bias_constraint": null, "filters": 512, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_size": [3, 3], "use_bias": true, "bias_regularizer": null, "kernel_regularizer": null, "dilation_rate": [1, 1]}}, {"name": "block5_conv2", "class_name": "Conv2D", "inbound_nodes": [[["block5_conv1", 0, 0, {}]]], "config": {"strides": [1, 1], "name": "block5_conv2", "activation": "relu", "data_format": "channels_last", "padding": "same", "kernel_constraint": null, "trainable": true, "activity_regularizer": null, "bias_constraint": null, "filters": 512, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_size": [3, 3], "use_bias": true, "bias_regularizer": null, "kernel_regularizer": null, "dilation_rate": [1, 1]}}, {"name": "block5_conv3", "class_name": "Conv2D", "inbound_nodes": [[["block5_conv2", 0, 0, {}]]], "config": {"strides": [1, 1], "name": "block5_conv3", "activation": "relu", "data_format": "channels_last", "padding": "same", "kernel_constraint": null, "trainable": true, "activity_regularizer": null, "bias_constraint": null, "filters": 512, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_size": [3, 3], "use_bias": true, "bias_regularizer": null, "kernel_regularizer": null, "dilation_rate": [1, 1]}}, {"name": "block5_pool", "class_name": "MaxPooling2D", "inbound_nodes": [[["block5_conv3", 0, 0, {}]]], "config": {"strides": [2, 2], "name": "block5_pool", "padding": "valid", "data_format": "channels_last", "trainable": true, "pool_size": [2, 2]}}, {"name": "global_average_pooling2d_1", "class_name": "GlobalAveragePooling2D", "inbound_nodes": [[["block5_pool", 0, 0, {}]]], "config": {"name": "global_average_pooling2d_1", "data_format": "channels_last", "trainable": true}}, {"name": "dense_1", "class_name": "Dense", "inbound_nodes": [[["global_average_pooling2d_1", 0, 0, {}]]], "config": {"name": "dense_1", "activation": "softmax", "kernel_constraint": null, "trainable": true, "units": 2, "bias_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null}}], "output_layers": [["dense_1", 0, 0]], "name": "model_1"}, "keras_version": "2.2.4", "class_name": "Model"}